emacs/setup/ido.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ido</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ido</h1>
<div class="org-src-container">
<pre class="src src-elisp">
<span class="org-comment-delimiter">;; </span><span class="org-comment">enable</span>
(ido-mode 1)
(ido-everywhere 1)

<span class="org-comment-delimiter">;; </span><span class="org-comment">variables</span>
(<span class="org-keyword">setq</span> ido-enable-flex-matching t)
(<span class="org-keyword">setq</span> ido-create-new-buffer 'prompt)
(<span class="org-keyword">setq</span> ido-enable-tramp-completion t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">bindings</span>
(global-set-key (kbd <span class="org-string">"&lt;f7&gt;"</span>) 'ido-bookmark-jump)

<span class="org-comment-delimiter">;; </span><span class="org-comment">https://www.emacswiki.org/emacs/InteractivelyDoThings</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Display ido results vertically, rather than horizontally</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq ido-decorations (quote ("\n-&gt; " "" "\n   " "\n   ..." "[" "]" " [No match]" " [Matched]" " [Not readable]" " [Too big]" " [Confirm]")))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">idomenu.el ; melpa</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "M-i") 'idomenu)</span>
</pre>
</div>

<p>
<a href="../setup.html">back</a>
</p>
</div>
</body>
</html>
